import Layout from '../components/layout'
import Image from 'next/image'
import Link from 'next/link'
import React, { useState } from "react";
import Lightbox from "lightbox-react";
import "lightbox-react/style.css";

const images = [
  "01.jpg", "02.jpg", "03.jpg", "04.jpg", "05.jpg", "06.jpg", "07.jpg", "08.jpg", "09.jpg", "10.jpg", "11.jpg", "12.jpg", "13.jpg", "14.jpg", "15.jpg", "16.jpg", "17.jpg", "18.jpg", "19.jpg", "20.jpg", "21.jpg", "22.jpg", "23.jpg", "24.jpg", "25.jpg", "26.jpg", "27.jpg", "28.jpg", "29.jpg", "30.jpg", "31.jpg", "32.jpg", "33.jpg", "34.jpg", "35.jpg"
]
const title = ["atelier anniversaire", "gran gusto", "浜松ジオラマグランプリ チラシイメージ", "YZF R15パーツほか", "RC甲子園レースページイメージ", "風萩工房＆あとりえ桃花窯", "Hamamatsu Music Messe 2014チラシイメージ", "第７回春の風コンサートチラシイメージ", "V-Works", "音楽イベントステージスタッフ養成講座チラシ", "マサウクレレ：ステッカー（マカフェリ）", "風萩工房トップページイメージ", "MASA UKULELEライブチラシ", "MASA UKULELE", "二胡七夕ライブチラシ", "詩人 千児みこ 名刺", "倉岡ギター教室", "JAZZ DIALOGUEライブチラシ", "美交工業サイト「雇用促進」ページ", "音楽と全人教育研究所 店村 眞知子", "夏野健一税理士事務所", "浜松ジオラマファクトリー", "GTNET", "GTNET購入準備アンケート", "Hamamatsu Music Messe 2014出展者カタログ", "YSP甲子園 サイト", "RC甲子園レースページ", "アーティスティックエージェンシー", "DRFTパソコン用壁紙", "西日本ハウス", "土屋社会保険労務士事務所", "デジタルハリウッド課題：「CDジャケット」", "大阪府営公園 住吉・住之江公園「まちの公園新聞」", "東栄グループ 旧サイト", "絵画オークションサイト eギャラリー・オークション"]


export default function Home() {
  const [photoIndex, setIndex] = useState(0);
  const [isOpen, setisOpen] = useState(false);

  return (
    <Layout
      title="K1ファクトリー 浜松市西区雄踏町でホームページ制作・チラシ・ポスターデータ制作ほか"
      description="中小規模のホームページ制作・管理、チラシ・ポスターデータ制作などを行います。ネット印刷を利用し製作価格を抑えます。"
    >
      <div className="text-center" style={{ height: '42vw' }}>
        <div className="fixed mt-6" style={{ width: '100vw', zIndex: '-1' }}>
          <Image src="/img/header-index.jpg" width={1200} height={503} alt="ホームページ制作、デザインのお手伝い K1ファクトリー（ケーワンファクトリー）" layout="responsive" />
        </div>
        <h1 className="text-sm z-1 pt-8">浜松市西区雄踏町でホームページ制作・チラシ・ポスターデータ制作ほか　K1ファクトリー</h1>
      </div>

      <div className="mx-auto px-6 pt-10 text-center bg-white">
        <section>
          {/* <h1><Image src="/img/ca_logo.svg" width={632} height={259} alt="ホームページ制作、デザインのお手伝い K1ファクトリー（ケーワンファクトリー）" className="mx-auto" /></h1> */}
          <h1><svg viewBox="0 0 158 68" style={{ maxWidth: '632' }} className="mx-auto" xmlns="http://www.w3.org/2000/svg" xmlSpace="preserve"><g fill="#0089CE"><path d="M60.999 16.662v42.562h-9.312V16.662h9.312zm16.785 0h12.932L72.192 37.623l17.941 21.602H77.142l-15.899-21.72 16.541-20.843zM107.613 16.537v42.438h-11.25V16.537h11.25z" /><path d="M99.488 27.041h-12l9.097-10.605z" /></g><g fill="#5A5A5A"><path d="M.396 7.939C1.26 7.048 1.72 5.823 1.854 4.32l.531.063c-.27 2.35-.927 3.295-1.521 3.979l-.468-.423zm4.016-6.742v1.584h3.367v.513H4.412v5.753h-.55V3.293H.54v-.512h3.322V1.197h.55zm2.061 3.132C6.869 6.66 7.625 7.57 7.94 7.957l-.468.36c-.54-.675-1.125-1.584-1.512-3.934l.513-.054zM16.833 4.815v.586H8.838v-.586h7.995zM23.033 4.554c1.215 1.585 1.873 2.845 2.422 4.114l-.54.252c-.09-.27-.18-.513-.351-.882-3.214.432-5.654.54-6.815.576l-.037-.584c.162.009.729-.019.801-.019 1.035-2.377 1.692-4.771 2.196-6.68l.604.099c-.432 1.63-1.405 4.771-2.215 6.554 2.043-.071 4.348-.233 5.249-.378-.504-.981-1.098-1.908-1.765-2.791l.451-.261zM26.073 5.868c.378-.459 2.151-2.736 2.341-2.926.315-.333.549-.414.81-.414.378 0 .711.171 1.179.63l4.187 4.114-.423.495-4.294-4.384c-.063-.063-.333-.315-.621-.315-.117 0-.288.045-.486.261-.279.307-.756.955-2.242 3.007l-.451-.468zm7.905-3.681c0 .513-.423.936-.945.936-.513 0-.937-.423-.937-.936 0-.531.423-.937.937-.945.512-.01.945.414.945.945zm-1.486 0c0 .297.243.54.54.54.306 0 .54-.252.54-.54 0-.307-.243-.541-.54-.541-.288 0-.54.225-.54.541zM43.329 4.815v.586h-7.995v-.586h7.995zM47.008 5.175c-.864-.468-1.702-.819-2.629-1.089l.234-.495c1.018.243 2.188.783 2.638 1.044l-.243.54zm-2.17 2.936c4.384-.415 5.627-2.603 6.464-5.213l.513.225c-1.125 3.43-2.853 5.077-6.833 5.581l-.144-.593zm2.899-5.106c-.765-.414-1.603-.783-2.656-1.08l.243-.477c.405.099 1.098.261 2.646 1.026l-.233.531zm2.98-.342c-.27-.549-.441-.837-.765-1.27l.432-.216c.45.495.684 1.035.783 1.242l-.45.244zm1.027-.431c-.171-.343-.414-.766-.783-1.233l.423-.217c.405.441.675.945.792 1.18l-.432.27zM54.919 2.096V.998h.468v1.098h2.017v.46h-2.017v1.26h2.224v.45h-2.224v1.071h1.882V8.11c0 .306-.108.477-.478.477h-.783l-.081-.495.667.019c.144 0 .198 0 .198-.253V5.779h-1.404v3.466h-.468V5.779h-1.467v2.872h-.459V5.337h1.926V4.266h-2.34v-.45h2.34v-1.26h-1.251c-.243.692-.414.909-.513 1.035l-.496-.217c.54-.773.666-1.269.828-2.205l.495.072c-.036.278-.072.495-.171.854h1.107zm3.61-.585v5.78h-.486v-5.78h.486zm1.99-.513v7.616c0 .495-.252.63-.729.63h-1.116l-.099-.522 1.225.019c.225 0 .225-.126.225-.234V.998h.494zM63.235 9.236h-.504V4.104c-.297.459-.622.918-.963 1.261l-.315-.504c1.197-1.261 1.782-2.512 2.232-3.854l.477.117c-.099.324-.324 1.017-.927 2.134v5.978zm.702-4.979c1.044-1.018 1.576-2.206 1.917-3.259l.478.135c-.081.234-.198.585-.522 1.27h3.998v.459h-3.16v1.711h2.962v.449h-2.962v1.702h2.962v.459h-2.962v2.053h-.522V2.862h-.549c-.54.99-.937 1.449-1.278 1.81l-.362-.415z" /></g><path fill="#5A5A5A" d="M74.035 8.974c-.531-.783-.9-1.206-1.386-1.71l.495-.396c.603.559 1.134 1.216 1.458 1.684l-.567.422z" /><g fill="#5A5A5A"><path d="M86.375 3.888v.531h-3.188v.387c0 .783-.188 2.017-.854 2.827-.621.756-1.558 1.107-2.638 1.332l-.225-.521c1.108-.226 1.944-.505 2.512-1.261.656-.882.647-2.215.656-2.403l.01-.36h-3.772v-.532h7.499zm-1.692-2.377v.504h-5.086v-.504h5.086zm.873 1.395c-.116-.333-.342-.9-.594-1.323l.433-.198c.188.297.539.99.647 1.306l-.486.215zm1.017-.422c-.072-.162-.333-.774-.675-1.306l.414-.207c.261.378.531.873.693 1.251l-.432.262zM93.17 1.169h.549v1.863h1.783v.514h-1.783V5.4c0 1.359-.702 2.26-1.395 2.728-.676.468-1.432.738-2.854.855l-.198-.531c1.324-.09 2.062-.288 2.8-.802 1.018-.711 1.099-1.854 1.099-2.224v-1.88h-3.565V6.22h-.549V3.546h-1.612v-.514h1.612V1.214h.549v1.818h3.565V1.169zm1.152 1.287c-.1-.612-.189-.981-.315-1.413l.46-.108c.188.495.323 1.107.387 1.414l-.532.107zm.999-.179c-.09-.486-.243-1.045-.378-1.44l.469-.108c.08.189.314.783.422 1.423l-.513.125zM101.152 9.037h-.566V4.401c-1.207.909-2.539 1.63-3.971 2.125l-.252-.531c1.27-.387 4.348-1.746 6.68-4.816l.541.324c-1.198 1.477-2.225 2.286-2.432 2.448v5.086zM107.938 3.654c-.791-.549-1.98-1.053-2.835-1.305l.306-.505c.685.207 1.891.657 2.846 1.278l-.317.532zm-2.719 4.447c2.674-.081 5.573-1.458 6.896-5.572l.522.216c-.333.945-1.044 2.872-2.845 4.321-1.252.999-2.791 1.566-4.394 1.647l-.179-.612zM117.146 8.38c1.062-.099 3.618-.342 3.618-3.223 0-.757-.252-3.106-3.168-3.124-.162 1.927-.405 3.7-1.261 5.068-.558.892-1.125 1.071-1.449 1.071-.874 0-1.585-1.071-1.585-2.529 0-2.314 1.594-4.105 4.285-4.105 2.791 0 3.736 1.908 3.736 3.556 0 3.376-2.943 3.709-4.016 3.809l-.16-.523zm-3.323-2.736c0 .747.279 1.962 1.054 1.962.342 0 .666-.243 1.018-.81.846-1.351 1.053-3.341 1.143-4.745-2.341.262-3.215 1.999-3.215 3.593zM124.795 1.169h.549v1.296h2.413v.505h-2.413v1.449c.298-.063.775-.171 1.514-.171.485 0 1.476.054 2.195.549.721.504.938 1.261.938 1.854 0 1.116-.748 1.63-1.145 1.827-.621.298-1.215.405-2.628.405l-.072-.521c1.404-.01 1.909-.072 2.44-.36.387-.216.81-.666.81-1.368 0-.541-.271-1.233-.981-1.612-.342-.188-.928-.297-1.539-.297-.793 0-1.27.117-1.531.181v3.088c0 .404-.035.747-.846.747-1.135 0-1.98-.621-1.98-1.765 0-1.251 1.044-1.989 2.277-2.431V2.97h-2.179v-.505h2.179V1.169zm0 3.88c-1.035.388-1.773 1.054-1.773 1.891 0 .621.432 1.287 1.449 1.287.262 0 .324-.054.324-.252V5.049zm3.7-3.79c.595.468 1.368 1.359 1.891 2.476l-.513.343c-.55-1.188-1.072-1.837-1.863-2.539l.485-.28zM135.506 3.591h3.375v.477h-3.375v1.611h3.789v.469h-3.789v2.305c0 .792-.595.792-.892.792h-1.503l-.091-.54 1.611.027c.126 0 .343-.01.343-.334v-2.25h-3.926v-.469h3.926V4.068h-3.494v-.477h3.494V2.015c-.99.081-2.053.108-3.457.126l-.055-.485c2.917-.01 4.682-.108 6.986-.631l.162.478c-.486.126-1.359.333-3.105.478v1.61zM141.76 9.236h-.478V4.14c-.478.738-.765.999-.963 1.17l-.288-.468c.873-.774 1.791-2.521 2.08-3.862l.467.108c-.09.405-.225 1.062-.818 2.224v5.924zm4.951-3.673c.559.801 1.297 2.412 1.521 3.411l-.469.181c-.045-.226-.08-.414-.252-.883-1.197.217-3.465.486-5.068.595l-.09-.478c.09 0 .729-.054.873-.062.379-.838 1.054-2.764 1.261-3.781h-2.008v-.45h5.808v.45H145c-.216.837-.9 2.926-1.277 3.736 1.8-.162 2.629-.234 3.637-.414-.459-1.099-.883-1.774-1.08-2.089l.431-.216zm1.306-3.602h-5.239v-.459h5.239v.459zM150.147 1.583c-.054.396-.162 1.233-.162 2.548 0 1.701.126 3.979 1.368 3.979.369 0 .621-.208.873-.522.207-.252.576-.802.918-1.729l.451.243c-.504 1.359-1.08 1.972-1.287 2.179-.145.144-.496.432-1.009.432-1.477 0-1.864-2.008-1.864-4.627 0-1.035.082-1.99.127-2.557l.585.054zm6.33 6.221c.018-.261.045-.576.045-1.035 0-2.98-1.107-4.024-1.765-4.564l.388-.36c1.205.928 1.962 2.332 1.962 5.123 0 .314-.009.54-.019.819l-.611.017z" /></g><g fill="#424242"><path d="M56.921 63.1v.416h-1.417c-.003 1.09-.184 1.919-.54 2.487s-.922.935-1.7 1.099l-.12-.41c.679-.148 1.169-.468 1.469-.958.299-.49.451-1.229.455-2.218h-1.804c-.185.555-.463 1.055-.833 1.5l-.338-.246c.567-.703.905-1.561 1.014-2.572l.419.023c-.029.316-.076.609-.142.879h3.537zM57.847 64.987v-.457h4.545v.457h-4.545zM63.651 64.682v-2.039h4.13v1.055c0 2.125-1.077 3.26-3.231 3.404l-.06-.434c.978-.07 1.698-.349 2.161-.835.463-.486.695-1.198.695-2.136v-.615h-3.264v1.6h-.431zM69.312 62.953l.196-.404c.596.32 1.166.66 1.711 1.02l-.218.404c-.511-.344-1.075-.684-1.689-1.02zm4.311.235c-.375 2.305-1.75 3.568-4.125 3.791l-.065-.451c1.09-.109 1.946-.446 2.569-1.011s1.027-1.372 1.212-2.423l.409.094zM74.794 62.701h4.147v.1c0 1.324-.29 2.33-.869 3.018s-1.478 1.102-2.695 1.242l-.076-.428c1.061-.129 1.846-.471 2.357-1.025.51-.555.787-1.377.831-2.467h-3.695v-.44zM80.744 63.914v-.393h3.543v.393c-.092.336-.242.643-.455.92s-.47.496-.771.656l-.223-.34c.522-.293.862-.705 1.019-1.236h-3.113zm.246 2.866c.381-.176.648-.441.801-.797s.229-.898.229-1.629h.409c0 .82-.092 1.438-.275 1.852s-.504.727-.962.938l-.202-.364zM89.463 63.258h-2.195c-.219.691-.588 1.299-1.111 1.822l-.301-.293c.691-.699 1.09-1.557 1.199-2.572l.42.029c-.018.184-.051.383-.098.598h2.539v.1c0 1.332-.293 2.326-.877 2.982-.586.656-1.52 1.043-2.801 1.16l-.066-.422c1.134-.117 1.957-.437 2.469-.958s.787-1.337.822-2.446zM92.668 62.321v1.752c1.027.266 2.066.609 3.117 1.031l-.131.434c-1.058-.426-2.053-.76-2.986-1.002v2.666h-.447v-4.881h.447zM97.496 65.104v-2.643h.447v2.643h-.447zm2.91-2.643h.457v1.535c0 1.008-.211 1.762-.635 2.262s-1.114.82-2.073.961l-.099-.439c.873-.141 1.482-.415 1.828-.823.348-.408.521-1.058.521-1.948v-1.548zM102.487 64.987v-.457h4.545v.457h-4.545z" /></g></svg></h1>
          <p className="py-5 text-sm md:text-base xl:text-lg">中小規模のホームページ制作・管理<br />チラシ・ポスターデータ制作<br />ネット印刷を利用し製作価格を抑えます</p>
          <p className="py-5 text-sm md:text-base xl:text-lg">お気軽にご相談ください</p>
          <Link href="/inquiry" passHref><button className="bg-blue-700 hover:bg-blue-500 text-white font-bold py-2 px-10 mb-10 rounded text-sm md:text-base xl:text-lg">お問い合わせ</button></Link>
        </section>
        <section>
          <h1 className="font-bold text-xl sm:text-2xl xl:text-4xl pt-20 pb-5">これまでの制作ギャラリー</h1>
          <ul className="flex flex-wrap justify-center">
            {images.map((image, index) => (
              <li className="w-1/2 sm:w-1/4 xl:w-1/6" key={index} style={{ display: 'inherit' }}>
                <Image
                  src={`/img/${image}`}
                  alt={image}
                  width={600}
                  height={600}
                  onClick={() => {
                    setisOpen(true), setIndex(index);
                  }}
                  className="hover:opacity-80"
                  loading="lazy"
                />
              </li>
            ))}
          </ul>
        </section>
        {
          isOpen && (
            <Lightbox
              mainSrc={`/img/${images[photoIndex]}`}
              nextSrc={images[(photoIndex + 1) % images.length]}
              prevSrc={images[(photoIndex + images.length - 1) % images.length]}
              onCloseRequest={() => setisOpen(false)}
              onMovePrevRequest={() =>
                setIndex((photoIndex + images.length - 1) % images.length)
              }
              onMoveNextRequest={() => setIndex((photoIndex + 1) % images.length)}
              imageTitle={title[photoIndex]}
              imageCaption={title[photoIndex]}
            />
          )
        }

        <section>
          <h1 className="font-bold text-xl sm:text-2xl xl:text-4xl pt-20 pb-5">制作・運営サイトリンク</h1>
          <ul>
            <li className="py-2"><a href="http://www.bikoh.biz/" target="_blank" rel="noopener noreferrer" className="hover:underline">美交工業</a>
            </li>
            <li className="py-2"><a href="https://www.toshi-kouen.jp/" target="_blank" rel="noopener noreferrer" className="hover:underline">いこいこ！おおさかの公園</a></li>
            <li className="py-2"><a href="http://tsuchiya-sr.com/" target="_blank" rel="noopener noreferrer" className="hover:underline">土屋社会保険労務士事務所</a></li>
            <li className="py-2"><a href="https://higashiosaka-parks.com/" target="_blank" rel="noopener noreferrer" className="hover:underline">花園中央公園 |
                  東大阪市特定公園</a></li>
            <li className="py-2"><a href="http://www.masaukulele.com/" target="_blank" rel="noopener noreferrer" className="hover:underline">マサウクレレ</a>／<a href="http://www.kuraoka-guitar.com" target="_blank" rel="noopener noreferrer" className="hover:underline">倉岡ギター教室</a></li>
            <li className="py-2"><a href="http://www.natsuno-kaikei.com/" target="_blank" rel="noopener noreferrer" className="hover:underline">夏野健一税理士事務所</a></li>
            <li className="py-2"><a href="http://osuka-japan.com/" target="_blank" rel="noopener noreferrer" className="hover:underline">Welcome to
                  Osuka</a></li>
            <li className="py-2"><a href="http://axis-mente.com/" target="_blank" rel="noopener noreferrer" className="hover:underline">コンクリート調査・診断のアクシス</a></li>
            <li className="py-2"><a href="http://buffetfive.com/" target="_blank" rel="noopener noreferrer" className="hover:underline">画廊ビュッフェファイヴ</a></li>
            <li className="py-2"><a href="https://saori-piano.net" target="_blank" rel="noopener noreferrer" className="hover:underline">なかむらさおり ぴあの教室</a></li>
          </ul>
          <p>ほか</p>
          <Link href="/inquiry" passHref><button className="bg-blue-700 hover:bg-blue-500 text-white font-bold py-2 px-10 my-10 rounded text-sm md:text-base xl:text-lg">お問い合わせ</button></Link>
        </section>
        <section>
          <h1 className="font-bold text-xl sm:text-2xl xl:text-4xl pt-20 pb-5">制作パートナー</h1>
          <ul>
            <li className="py-2"><a href="http://www.miraigaso.com/" target="_blank" rel="noopener noreferrer" className="hover:underline">未来画素</a></li>
          </ul>
        </section>
      </div>
    </Layout>

  )
}
